BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.h
/***************************************************************************//**
* \file `$INSTANCE_NAME`_SensingCSD_LL.h
* \version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* \brief
*   This file provides the headers of APIs specific to CSD sensing implementation.
*
* \see CapSense v`$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION` Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(CY_CAPSENSE_`$INSTANCE_NAME`_SENSINGCSD_LL_H)
#define CY_CAPSENSE_`$INSTANCE_NAME`_SENSINGCSD_LL_H

#include "cyfitter_gpio.h"
#include "syslib/cy_syslib.h"
#include "`$INSTANCE_NAME`_Structure.h"
#include "`$INSTANCE_NAME`_Configuration.h"

/****************************************************************************
* Register and mode mask definition
****************************************************************************/


/* CMOD and CSH capacitor port-pins registers */
#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN)

    #if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && \
         (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN))
        #define `$INSTANCE_NAME`_CTANK_CONNECTION                   (`$INSTANCE_NAME`_CSD__DEDICATED_IO1)
    #endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && \
               (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN)) */

    #if(0u != `$INSTANCE_NAME`_CSX_EN)
        #define `$INSTANCE_NAME`_CMOD_CONNECTION                    (`$INSTANCE_NAME`_CSD__CSHIELD_PAD)
    #else
        #define `$INSTANCE_NAME`_CMOD_CONNECTION                    (`$INSTANCE_NAME`_CSD__DEDICATED_IO0)
    #endif /* (0u != `$INSTANCE_NAME`_CSX_EN) */

    #define `$INSTANCE_NAME`_CSD_CMOD_PORT_PTR                      (`$INSTANCE_NAME`_Cmod_0_PORT)
    #define `$INSTANCE_NAME`_CSD_CMOD_PIN                           (`$INSTANCE_NAME`_Cmod_0_NUM)

    #define `$INSTANCE_NAME`_CSD_CTANK_PORT_PTR                     (`$INSTANCE_NAME`_Csh_0_PORT)
    #define `$INSTANCE_NAME`_CSD_CTANK_PIN                          (`$INSTANCE_NAME`_Csh_0_NUM)

#endif  /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN) */

#define `$INSTANCE_NAME`_CSD_CSDCMP_INIT                                (`$INSTANCE_NAME`_CSD_CSDCMP_CSDCMP_DISABLED)

/* SW_HS_P_SEL switches state for Coarse initialization of CMOD (sense path) */
#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN)
    #if (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION)
        #define `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_CMOD               (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE)
    #elif (`$INSTANCE_NAME`_CSD__CSHIELD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION)
        #define `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_CMOD               (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE)
    #else
        #define `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_CMOD               (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE)
    #endif /* (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION) */
#else
    #define `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_CMOD                   (0x00000000uL)
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_CSX_EN) && (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN)) */

#if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) && \
    (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN))
    /* SW_HS_P_SEL switches state for Coarse initialization of CTANK (sense path) */
    #if (`$INSTANCE_NAME`_CSD__CSH_TANK_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION)
        #define `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_TANK               (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE)
    #elif (`$INSTANCE_NAME`_CSD__CSHIELD_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION)
        #define `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_TANK               (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE)
    #elif (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION)
        #define `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_TANK               (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE)
    #else
        #define `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_TANK               (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMMA_STATIC_CLOSE)
    #endif /* (`$INSTANCE_NAME`_CSD__CSH_TANK_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION) */
#else
    #define `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_TANK                   (0x00000000uL)
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) && \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)) */

#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_COARSE                         (`$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_CMOD | `$INSTANCE_NAME`_CSD_HS_P_SEL_COARSE_TANK)

/* C_mod config */
#if ((`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION) || (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION))
    #define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_INIT             (`$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1PM_STATIC_CLOSE |\
                                                                 `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1MA_STATIC_CLOSE |\
                                                                 `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1CA_STATIC_CLOSE)
#else
    #define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_INIT             (0x00000000uL)
#endif /* (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION) */

/* C_tank config */
#if ((`$INSTANCE_NAME`_CSD__CSH_TANK_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION) || (`$INSTANCE_NAME`_CSD__CSH_TANK_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION))
    #define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_INIT            (`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE |\
                                                                 `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2MA_STATIC_CLOSE |\
                                                                 `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2CA_STATIC_CLOSE)
#else
    #define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_INIT            (0x00000000uL)
#endif /* (`$INSTANCE_NAME`_CSD__CSH_TANK_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION) */

#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_INIT                 (`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAV_HSCMP)

#if(`$INSTANCE_NAME`_CSD_IREF_SRSS != `$INSTANCE_NAME`_CSD_IREF_SOURCE)
    #define `$INSTANCE_NAME`_IREF_SRC_CFG   (CSD_CONFIG_IREF_SEL_Msk)
#else
    #define `$INSTANCE_NAME`_IREF_SRC_CFG   (0u)
#endif /* (`$INSTANCE_NAME`_CSD_IREF_SRSS != `$INSTANCE_NAME`_CSD_IREF_SOURCE) */

#if(`$INSTANCE_NAME`_ENABLE != `$INSTANCE_NAME`_LP_MODE_EN)
    #define `$INSTANCE_NAME`_PWR_MODE_CFG   (0u)
#else
    #define `$INSTANCE_NAME`_PWR_MODE_CFG   (CSD_CONFIG_LP_MODE_Msk)
#endif /* (`$INSTANCE_NAME`_ENABLE != `$INSTANCE_NAME`_LP_MODE_EN) */

/* Defining default CSDv2 configuration according to settings in customizer. */
#define `$INSTANCE_NAME`_DEFAULT_CSD_CONFIG                 (`$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_12MHZ |\
                                                             `$INSTANCE_NAME`_IREF_SRC_CFG |\
                                                             `$INSTANCE_NAME`_PWR_MODE_CFG)

#if(`$INSTANCE_NAME`_SENSING_LEGACY == `$INSTANCE_NAME`_CSD_SENSING_METHOD)

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_AUTO_ZERO_EN)
        /* Enable CSDCMP */
        #define `$INSTANCE_NAME`_CSD_CSDCMP_SCAN                (`$INSTANCE_NAME`_CSD_CSDCMP_CSDCMP_EN_MSK |\
                                                                 `$INSTANCE_NAME`_CSD_CSDCMP_AZ_EN_MSK)
    #else
        /* Enable CSDCMP */
        #define `$INSTANCE_NAME`_CSD_CSDCMP_SCAN                (`$INSTANCE_NAME`_CSD_CSDCMP_CSDCMP_EN_MSK)
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_AUTO_ZERO_EN) */

    #if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) && \
        (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN))
        /* SW_HS_P_SEL switches state for Coarse initialization of CTANK (sense path) */
        #if (`$INSTANCE_NAME`_CSD__CSH_TANK_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION)
            #define `$INSTANCE_NAME`_CSD_HS_P_SEL_SCAN_TANK                 (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE)
        #elif (`$INSTANCE_NAME`_CSD__CSHIELD_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION)
            #define `$INSTANCE_NAME`_CSD_HS_P_SEL_SCAN_TANK                 (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE)
        #elif (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION)
            #define `$INSTANCE_NAME`_CSD_HS_P_SEL_SCAN_TANK                 (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE)
        #else
            #define `$INSTANCE_NAME`_CSD_HS_P_SEL_SCAN_TANK                 (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE)
        #endif /* (`$INSTANCE_NAME`_CSD__CSH_TANK_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION) */
        #define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SCAN                       (`$INSTANCE_NAME`_CSD_HS_P_SEL_SCAN_TANK)
    #elif(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        #define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SCAN                       (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE)
    #else
        #define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SCAN                       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN)
    #endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) && \
               (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)) */

    /* SW_FW_MOD_SEL switches state for Coarse initialization of CMOD (sense path) */
    #define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SCAN                 (0x00000000uL)

    #if((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && \
        (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) && \
        (`$INSTANCE_NAME`_CSD__CSH_TANK_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION))
        #define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SCAN            (`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE | \
                                                                 `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2CB_STATIC_CLOSE)
    #else
        #define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SCAN            (0x00000000uL)
    #endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && \
               (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) && \
               (`$INSTANCE_NAME`_CSD__CSH_TANK_PAD == `$INSTANCE_NAME`_CTANK_CONNECTION)) */

    /* Shield switch default config */
    #if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && \
         (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN))
        #if (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG)
            #define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN          (`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_HSCMP)
        #else
            #define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN          (`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_HSCMP)
        #endif /* (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG) */
    #elif(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        #if (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG)
            #define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN          (`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_PHI1 | \
                                                                     `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_PHI2_HSCMP)
        #else
            #define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN          (`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_PHI1 | \
                                                                     `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_PHI2_HSCMP)
        #endif /* (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG) */
    #else
        #define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN              (0x00000000uL)
    #endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && \
               (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN)) */

    #define `$INSTANCE_NAME`_CSD_SW_RES_INIT                        (`$INSTANCE_NAME`_CSD_INIT_SWITCH_RES << CSD_SW_RES_RES_HCAV_Pos)
    #define `$INSTANCE_NAME`_CSD_SW_RES_SCAN                        ((`$INSTANCE_NAME`_CSD_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCBV_Pos) |\
                                                                     (`$INSTANCE_NAME`_CSD_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCBG_Pos))

    #define `$INSTANCE_NAME`_CSD_SHIELD_GPIO_DM                 (CY_GPIO_DM_STRONG_IN_OFF)
    #define `$INSTANCE_NAME`_CSD_SENSOR_HSIOM_SEL               (`$INSTANCE_NAME`_HSIOM_SEL_CSD_SENSE)
    #define `$INSTANCE_NAME`_CSD_SHIELD_HSIOM_SEL               (`$INSTANCE_NAME`_HSIOM_SEL_CSD_SHIELD)
    #define `$INSTANCE_NAME`_CSD_CMOD_HSIOM_SEL                 (`$INSTANCE_NAME`_HSIOM_SEL_AMUXA)

    #define `$INSTANCE_NAME`_DEFAULT_IDACA_BALL_MODE            (`$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_FULL <<\
                                                                 `$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_POS)
    #define `$INSTANCE_NAME`_DEFAULT_IDACB_BALL_MODE            (`$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_FULL <<\
                                                                 `$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_POS)

    #define `$INSTANCE_NAME`_DEFAULT_SENSE_DUTY_SEL             (0x00000000uL)

#elif(`$INSTANCE_NAME`_SENSING_LOW_EMI == `$INSTANCE_NAME`_CSD_SENSING_METHOD)

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_AUTO_ZERO_EN)
        /* Enable CSDCMP */
        #define `$INSTANCE_NAME`_CSD_CSDCMP_SCAN                (`$INSTANCE_NAME`_CSD_CSDCMP_CSDCMP_EN_MSK  |\
                                                                 `$INSTANCE_NAME`_CSD_CSDCMP_CMP_PHASE_PHI2 |\
                                                                 `$INSTANCE_NAME`_CSD_CSDCMP_AZ_EN_MSK)
    #else
        /* Enable CSDCMP */
        #define `$INSTANCE_NAME`_CSD_CSDCMP_SCAN                (`$INSTANCE_NAME`_CSD_CSDCMP_CSDCMP_EN_MSK |\
                                                                 `$INSTANCE_NAME`_CSD_CSDCMP_CMP_PHASE_PHI2)
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_AUTO_ZERO_EN) */

    #if(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        #define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SCAN               (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE)
    #else
        #define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SCAN               (`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_OPEN)
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */

    #if (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION)
        #define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SCAN             (`$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1PM_STATIC_CLOSE |\
                                                                     `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1CA_PHI2)
        #define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SCAN            (0x00000000uL)
    #else
        #define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SCAN             (0x00000000uL)
        #define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SCAN            (`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE |\
                                                                     `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2CA_PHI2)
    #endif /* (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION) */

    #if(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        #if(`$INSTANCE_NAME`_IDAC_SINKING != `$INSTANCE_NAME`_CSD_IDAC_CONFIG)
            #define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN             (`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_PHI2_HSCMP | `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_PHI1 | `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAG_PHI1)
        #else
            #define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN             (`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_PHI1 | `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_PHI2_HSCMP | `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAV_PHI1)
        #endif /* (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG) */
    #else
        #if(`$INSTANCE_NAME`_IDAC_SINKING != `$INSTANCE_NAME`_CSD_IDAC_CONFIG)
            #define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN             (`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAG_PHI1)
        #else
            #define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN             (`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAV_PHI1)
        #endif /* (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG) */
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */

    #define `$INSTANCE_NAME`_CSD_SW_RES_INIT                    ((`$INSTANCE_NAME`_CSD_F1PM_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_F1PM_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_F2PT_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_F2PT_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_HCAG_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_HCAG_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_HCAV_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_HCAV_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_HCBG_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_HCBG_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_HCBV_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_HCBV_Pos))

    #define `$INSTANCE_NAME`_CSD_SW_RES_SCAN                    ((`$INSTANCE_NAME`_CSD_F1PM_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_F1PM_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_F2PT_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_F2PT_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_HCAG_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_HCAG_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_HCAV_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_HCAV_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_HCBG_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_HCBG_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSD_HCBV_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_HCBV_Pos))

    #define `$INSTANCE_NAME`_CSD_SHIELD_GPIO_DM                 (CY_GPIO_DM_ANALOG)
    #define `$INSTANCE_NAME`_CSD_SENSOR_HSIOM_SEL               (`$INSTANCE_NAME`_HSIOM_SEL_AMUXA)
    #define `$INSTANCE_NAME`_CSD_SHIELD_HSIOM_SEL               (`$INSTANCE_NAME`_HSIOM_SEL_AMUXB)
    #define `$INSTANCE_NAME`_CSD_CMOD_HSIOM_SEL                 (`$INSTANCE_NAME`_HSIOM_SEL_GPIO)

    #define `$INSTANCE_NAME`_DEFAULT_IDACA_BALL_MODE            (`$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_PHI2 <<\
                                                                 `$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_POS)
    #define `$INSTANCE_NAME`_DEFAULT_IDACB_BALL_MODE            (`$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_FULL <<\
                                                                 `$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_POS)

    #if(`$INSTANCE_NAME`_IDAC_SINKING != `$INSTANCE_NAME`_CSD_IDAC_CONFIG)
        #define `$INSTANCE_NAME`_DEFAULT_SENSE_DUTY_SEL             (0x00000000uL)
    #else
        #define `$INSTANCE_NAME`_DEFAULT_SENSE_DUTY_SEL             (`$INSTANCE_NAME`_CSD_SENSE_DUTY_SENSE_POL_MSK)
    #endif /* (`$INSTANCE_NAME`_IDAC_SINKING != `$INSTANCE_NAME`_CSD_IDAC_CONFIG) */

