BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.h
#elif(`$INSTANCE_NAME`_SENSING_FULL_WAVE == `$INSTANCE_NAME`_CSD_SENSING_METHOD)
#else
    #error "Not supported sensing method."
#endif /* (`$INSTANCE_NAME`_SENSING_LEGACY == `$INSTANCE_NAME`_CSD_SENSING_METHOD) */


/***************************************
* API Constants
***************************************/
/* Definition of time interval that is enough for charging 100nF capacitor */
#define `$INSTANCE_NAME`_CSD_AVG_CYCLES_PER_LOOP                    (5u)
#define `$INSTANCE_NAME`_CSD_MAX_CHARGE_TIME_US                     (100u)
#define `$INSTANCE_NAME`_CSD_PRECHARGE_WATCHDOG_CYCLES_NUM          (((`$INSTANCE_NAME`_CPU_CLOCK_FREQ_MHZ) * (`$INSTANCE_NAME`_CSD_MAX_CHARGE_TIME_US)) /\
                                                                        (`$INSTANCE_NAME`_CSD_AVG_CYCLES_PER_LOOP))

#define `$INSTANCE_NAME`_CSD_IDAC_MOD_BITS_USED                     (7u)
#define `$INSTANCE_NAME`_CAL_MIDDLE_BIT                             (1u << (`$INSTANCE_NAME`_CSD_IDAC_MOD_BITS_USED - 1u))
#define `$INSTANCE_NAME`_MAX_16_BITS_VALUE                          (0x0000FFFFLu)
#define `$INSTANCE_NAME`_MAX_SCAN_TIME                              (`$INSTANCE_NAME`_MAX_16_BITS_VALUE * `$INSTANCE_NAME`_CSD_SCANSPEED_DIVIDER)
#define `$INSTANCE_NAME`_CALIBR_WATCHDOG_CYCLES_NUM                 (`$INSTANCE_NAME`_MAX_SCAN_TIME / `$INSTANCE_NAME`_CSD_AVG_CYCLES_PER_LOOP)

#define `$INSTANCE_NAME`_DELAY_EXTRACYCLES_NUM                      (9u)

/* Calibration constants */
#define `$INSTANCE_NAME`_IDAC_MOD_MAX_CALIB_ERROR                   (10u)

#if (`$INSTANCE_NAME`_IDAC_GAIN_8X == `$INSTANCE_NAME`_CSD_IDAC_GAIN)
    #define `$INSTANCE_NAME`_CSD_IDAC_GAIN_VALUE_NA                 (2400u)
#elif (`$INSTANCE_NAME`_IDAC_GAIN_HIGH == `$INSTANCE_NAME`_CSD_IDAC_GAIN)
    #define `$INSTANCE_NAME`_CSD_IDAC_GAIN_VALUE_NA                 (2400u)
#elif (`$INSTANCE_NAME`_IDAC_GAIN_4X == `$INSTANCE_NAME`_CSD_IDAC_GAIN)
    #define `$INSTANCE_NAME`_CSD_IDAC_GAIN_VALUE_NA                 (1200u)
#elif (`$INSTANCE_NAME`_IDAC_GAIN_MEDIUM == `$INSTANCE_NAME`_CSD_IDAC_GAIN)
    #define `$INSTANCE_NAME`_CSD_IDAC_GAIN_VALUE_NA                 (300u)
#else
    #define `$INSTANCE_NAME`_CSD_IDAC_GAIN_VALUE_NA                 (37u)
#endif /* (`$INSTANCE_NAME`_IDAC_GAIN_8X == `$INSTANCE_NAME`_CSD_IDAC_GAIN) */

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN)
    #define `$INSTANCE_NAME`_CSD_DUAL_IDAC_FACTOR                   (2u)
#else
    #define `$INSTANCE_NAME`_CSD_DUAL_IDAC_FACTOR                   (1u)
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) */

/* Defining the drive mode of pins depending on the Inactive sensor connection setting in the component customizer. */
#if(`$INSTANCE_NAME`_SNS_CONNECTION_GROUND == `$INSTANCE_NAME`_CSD_INACTIVE_SNS_CONNECTION)
    #define `$INSTANCE_NAME`_CSD_INACTIVE_SNS_GPIO_DM               (CY_GPIO_DM_STRONG)
#elif(`$INSTANCE_NAME`_SNS_CONNECTION_HIGHZ == `$INSTANCE_NAME`_CSD_INACTIVE_SNS_CONNECTION)
    #define `$INSTANCE_NAME`_CSD_INACTIVE_SNS_GPIO_DM               (CY_GPIO_DM_ANALOG)
#elif(`$INSTANCE_NAME`_SNS_CONNECTION_SHIELD == `$INSTANCE_NAME`_CSD_INACTIVE_SNS_CONNECTION)
    #define `$INSTANCE_NAME`_CSD_INACTIVE_SNS_GPIO_DM               (CY_GPIO_DM_STRONG_IN_OFF)
#else
    #error "Unsupported inactive connection for the inactive sensors."
#endif /* (`$INSTANCE_NAME`_SNS_CONNECTION_GROUND == `$INSTANCE_NAME`_CSD_INACTIVE_SNS_CONNECTION) */


/* Clock Source Mode */
#if (`$INSTANCE_NAME`_CLK_SOURCE_DIRECT == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
    #define `$INSTANCE_NAME`_DEFAULT_MODULATION_MODE                (`$INSTANCE_NAME`_CLK_SOURCE_DIRECT)
#elif (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
    #define `$INSTANCE_NAME`_DEFAULT_MODULATION_MODE                (`$INSTANCE_NAME`_CLK_SOURCE_SSC2)
#elif ((`$INSTANCE_NAME`_CLK_SOURCE_PRS8) == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
    #define `$INSTANCE_NAME`_DEFAULT_MODULATION_MODE                (`$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
#elif ((`$INSTANCE_NAME`_CLK_SOURCE_PRS12) == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
    #define `$INSTANCE_NAME`_DEFAULT_MODULATION_MODE                (`$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
#else
    #define `$INSTANCE_NAME`_DEFAULT_MODULATION_MODE                (`$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
#endif /* (`$INSTANCE_NAME`_CLK_SOURCE_DIRECT != `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE) */

/* IDACs Ranges */
#if (`$INSTANCE_NAME`_IDAC_GAIN_LOW == `$INSTANCE_NAME`_CSD_IDAC_GAIN)
    #define `$INSTANCE_NAME`_DEFAULT_IDACA_RANGE                    (`$INSTANCE_NAME`_CSD_IDACA_RANGE_IDAC_LO << `$INSTANCE_NAME`_CSD_IDACA_RANGE_POS)
    #define `$INSTANCE_NAME`_DEFAULT_IDACB_RANGE                    (`$INSTANCE_NAME`_CSD_IDACB_RANGE_IDAC_LO << `$INSTANCE_NAME`_CSD_IDACB_RANGE_POS)
#elif (`$INSTANCE_NAME`_IDAC_GAIN_MEDIUM == `$INSTANCE_NAME`_CSD_IDAC_GAIN)
    #define `$INSTANCE_NAME`_DEFAULT_IDACA_RANGE                    (`$INSTANCE_NAME`_CSD_IDACA_RANGE_IDAC_MED << `$INSTANCE_NAME`_CSD_IDACA_RANGE_POS)
    #define `$INSTANCE_NAME`_DEFAULT_IDACB_RANGE                    (`$INSTANCE_NAME`_CSD_IDACB_RANGE_IDAC_MED << `$INSTANCE_NAME`_CSD_IDACB_RANGE_POS)
#else
    #define `$INSTANCE_NAME`_DEFAULT_IDACA_RANGE                    (`$INSTANCE_NAME`_CSD_IDACA_RANGE_IDAC_HI << `$INSTANCE_NAME`_CSD_IDACA_RANGE_POS)
    #define `$INSTANCE_NAME`_DEFAULT_IDACB_RANGE                    (`$INSTANCE_NAME`_CSD_IDACB_RANGE_IDAC_HI << `$INSTANCE_NAME`_CSD_IDACB_RANGE_POS)
#endif

/* IDACs Polarities */
#if (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG)
    #define `$INSTANCE_NAME`_DEFAULT_IDACA_POLARITY                 (`$INSTANCE_NAME`_CSD_IDACA_POLARITY_VDDA_SNK << `$INSTANCE_NAME`_CSD_IDACA_POLARITY_POS)
    #define `$INSTANCE_NAME`_DEFAULT_IDACB_POLARITY                 (`$INSTANCE_NAME`_CSD_IDACB_POLARITY_VDDA_SNK << `$INSTANCE_NAME`_CSD_IDACB_POLARITY_POS)
#else
    #define `$INSTANCE_NAME`_DEFAULT_IDACA_POLARITY                 (`$INSTANCE_NAME`_CSD_IDACA_POLARITY_VSSA_SRC << `$INSTANCE_NAME`_CSD_IDACA_POLARITY_POS)
    #define `$INSTANCE_NAME`_DEFAULT_IDACB_POLARITY                 (`$INSTANCE_NAME`_CSD_IDACB_POLARITY_VSSA_SRC << `$INSTANCE_NAME`_CSD_IDACB_POLARITY_POS)
#endif /*  (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG) */


#if(`$INSTANCE_NAME`_CSD_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE)
    #define `$INSTANCE_NAME`_CSD_SW_REFGEN_VREF_SRC                 (`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_SGRP_MSK)
#else
    #define `$INSTANCE_NAME`_CSD_SW_REFGEN_VREF_SRC                 (`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_SGR_MSK)
#endif /* (`$INSTANCE_NAME`_CSD_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE) */


/* IDAC legs configuration */
#if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN))
        #define `$INSTANCE_NAME`_DEFAULT_SW_REFGEN_SEL              (`$INSTANCE_NAME`_CSD_SW_REFGEN_VREF_SRC | `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_IAIB_MSK)
        #define `$INSTANCE_NAME`_DEFAULT_IDACB_LEG1_MODE            (`$INSTANCE_NAME`_CSD_IDACB_LEG1_EN_MSK |\
                                                                    (`$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_CSD_STATIC << `$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_POS))
#else
        #define `$INSTANCE_NAME`_DEFAULT_SW_REFGEN_SEL              (`$INSTANCE_NAME`_CSD_SW_REFGEN_VREF_SRC)
        #define `$INSTANCE_NAME`_DEFAULT_IDACB_LEG1_MODE            (`$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_GP_STATIC << `$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_POS)
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)) */


#if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
     (`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN))
        #define `$INSTANCE_NAME`_DEFAULT_IDACB_LEG2_MODE            (`$INSTANCE_NAME`_CSD_IDACA_LEG2_EN_MSK |\
                                                                    (`$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_CSD_STATIC << `$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_POS))
#else
        #define `$INSTANCE_NAME`_DEFAULT_IDACB_LEG2_MODE            (`$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_GP_STATIC << `$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_POS)
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
        (`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)) */

/* IDACs register configuration is based on the component configuration */
#define `$INSTANCE_NAME`_IDAC_MOD_DEFAULT_CFG                       (`$INSTANCE_NAME`_DEFAULT_IDACA_RANGE | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACA_POLARITY | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACA_BALL_MODE | \
                                                                    (`$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_CSD << `$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_POS) | \
                                                                     `$INSTANCE_NAME`_CSD_IDACA_LEG1_EN_MSK | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACB_LEG2_MODE)

