BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.h
#define `$INSTANCE_NAME`_IDAC_COMP_DEFAULT_CFG                      (`$INSTANCE_NAME`_DEFAULT_IDACB_RANGE | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACB_POLARITY | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACB_BALL_MODE | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACB_LEG1_MODE | \
                                                                    (`$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_GP_STATIC << `$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_POS))

#define `$INSTANCE_NAME`_IDAC_MOD_CALIBRATION_CFG                   (`$INSTANCE_NAME`_DEFAULT_IDACA_RANGE | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACA_POLARITY | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACA_BALL_MODE | \
                                                                    (`$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_CSD << `$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_POS) | \
                                                                     `$INSTANCE_NAME`_CSD_IDACA_LEG1_EN_MSK | \
                                                                    (`$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_GP_STATIC << `$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_POS))

#define `$INSTANCE_NAME`_IDAC_COMP_CALIBRATION_CFG                  (`$INSTANCE_NAME`_DEFAULT_IDACB_RANGE | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACB_POLARITY | \
                                                                     `$INSTANCE_NAME`_DEFAULT_IDACB_BALL_MODE | \
                                                                    (`$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_GP_STATIC << `$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_POS) | \
                                                                    (`$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_GP_STATIC << `$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_POS))

/***************************************
* Global software variables
***************************************/

extern uint32 `$INSTANCE_NAME`_configCsd;

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN)
    extern uint8 `$INSTANCE_NAME`_badConversionsNum;
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN) */


/***************************************
* Function Prototypes
**************************************/

/* Interrupt handler */
extern void `$INSTANCE_NAME`_CSDPostSingleScan(void);
extern void `$INSTANCE_NAME`_CSDPostMultiScan(void);

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
    extern void `$INSTANCE_NAME`_CSDPostMultiScanGanged(void);
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN) */


/**
* \if SECTION_CAPSENSE_LOW_LEVEL
* \addtogroup group_capsense_low_level
* \{
*/

void `$INSTANCE_NAME`_CSDSetupWidget(uint32 widgetId);
void `$INSTANCE_NAME`_CSDSetupWidgetExt(uint32 widgetId, uint32 sensorId);
void `$INSTANCE_NAME`_CSDScan(void);
void `$INSTANCE_NAME`_CSDScanExt(void);
#if ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN))
    cy_status `$INSTANCE_NAME`_CSDCalibrateWidget(uint32 widgetId, uint32 target);
#endif /* ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) || \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN))  */
void `$INSTANCE_NAME`_CSDConnectSns(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *snsAddrPtr);
void `$INSTANCE_NAME`_CSDDisconnectSns(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *snsAddrPtr);

/** \}
* \endif */

/*****************************************************
* Function Prototypes - internal Low Level functions
*****************************************************/
/**
* \if SECTION_CAPSENSE_INTERNAL
* \addtogroup group_capsense_internal
* \{
*/

void `$INSTANCE_NAME`_SsCSDInitialize(void);
void `$INSTANCE_NAME`_SsCSDStartSample(void);
void `$INSTANCE_NAME`_SsCSDSetUpIdacs(`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT const *ptrWdgt);
void `$INSTANCE_NAME`_SsCSDConfigClock(void);
void `$INSTANCE_NAME`_SsCSDElectrodeCheck(void);
#if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && \
     (0u != `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT))
    void `$INSTANCE_NAME`_SsCSDDisableShieldElectrodes(void);
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && \
           (0u != `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT)) */
uint32 `$INSTANCE_NAME`_SsCSDGetNumberOfConversions(uint32 snsClkDivider, uint32 resolution, uint32 snsClkSrc);
void `$INSTANCE_NAME`_SsCSDCalculateScanDuration(`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT const *ptrWdgt);
void `$INSTANCE_NAME`_SsCSDConnectSensorExt(uint32 widgetId, uint32 sensorId);
void `$INSTANCE_NAME`_SsCSDDisconnectSnsExt(uint32 widgetId, uint32 sensorId);

#if ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_SELF_TEST_EN) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN))
#endif /* ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) || \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_SELF_TEST_EN) || \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN)) */

/** \}
* \endif */

/***************************************
* Global software variables
***************************************/
extern uint32 `$INSTANCE_NAME`_configCsd;
/* Interrupt handler */
extern void `$INSTANCE_NAME`_CSDPostSingleScan(void);
extern void `$INSTANCE_NAME`_CSDPostMultiScan(void);
#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
extern void `$INSTANCE_NAME`_CSDPostMultiScanGanged(void);
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN) */
#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN)
    extern uint8 `$INSTANCE_NAME`_badConversionsNum;
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN) */

#endif /* End CY_CAPSENSE_`$INSTANCE_NAME`_SENSINGCSD_LL_H */


/* [] END OF FILE */
